app/views/forum_posts/index.html.erb

      <tr class="forum-post">
        <td class="time-stamper"> posted by <strong><%= User.where(id: post.user_id).pluck(:name).join %></strong> at <%= post.created_at %>
---
SELECT "users"."name" FROM "users" WHERE "users"."id" = ?  [["id", 3]]