app/controllers/cars_controller.rb

  def create
    @car = Car.new(car_params)
    @car.user_id = current_user.id
    if @car.save
---
INSERT INTO "cars" ("year", "make", "model", "car_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["year", 2018], ["make", "Dodge"], ["model", "Challenger"], ["car_name", "Cirilla"], ["user_id", 1], ["created_at", "2019-07-08 00:35:46.887040"], ["updated_at", "2019-07-08 00:35:46.887040"]]

  def index
    @cars = Car.where(user_id: current_user.id)
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = ?  [["user_id", 7]]