app/controllers/forum_posts_controller.rb

  def create
    @forum_post = ForumPost.new(forum_params)
    @forum_post.user_id = current_user.id if current_user
    if @forum_post.save
---
INSERT INTO "forum_posts" ("topic", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["topic", "stuff"], ["content", "very cool stuff"], ["user_id", 3], ["created_at", "2019-07-11 21:23:16.786427"], ["updated_at", "2019-07-11 21:23:16.786427"]]

  def index
    @forum_posts = ForumPost.all
---
SELECT "forum_posts".* FROM "forum_posts"