app/controllers/fuel_logs_controller.rb

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def new
        @fuel_log = FuelLog.new
        @car = Car.find(params[:id])

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "fuel_logs" ("fueltype", "gasprice", "price", "mileage", "user_id", "created_at", "updated_at", "car_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
      def create
        @fuel_log = FuelLog.new(fuel_log_params)
        @car = Car.find(params[:id])
        @fuel_log.car_id = @car.id
        @fuel_log.user_id = current_user.id
        if @fuel_log.save

SELECT "fuel_logs".* FROM "fuel_logs" WHERE "fuel_logs"."user_id" = ?  [["user_id", 1]]
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = ?  [["user_id", 1]]
---
      def index
        if params[:id]
          id = params[:id]
        else
          id = current_user.id
        end
        @fuel_logs = FuelLog.where(user_id: id)
        @cars = Car.where(user_id: id)