app/controllers/search_controller.rb

  def index
    if params[:name]
      name = params[:name].split.join("%")
      name << '%'
      name = '%' + name
      @users = User.where("name like ?", name)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "name"]]