app/views/fuel_logs/index.html.erb

                  <%# get name first%>
                  <% name = Car.where(id: fuel_log.car_id).pluck(:car_name).join%>
                  <td><h3><%= Car.where(id: fuel_log.car_id).pluck(:car_name).join %></h3></td>
                  <td colspan="3">
                    <h3><%= Car.where(id: fuel_log.car_id).pluck(:year).join %>
                    <%= Car.where(id: fuel_log.car_id).pluck(:make).join %>
                    <%= Car.where(id: fuel_log.car_id).pluck(:model).join %></h3>
---
SELECT "cars"."car_name" FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
SELECT "cars"."year" FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
SELECT "cars"."make" FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]
SELECT "cars"."model" FROM "cars" WHERE "cars"."id" = ?  [["id", 1]]