app/views/fuel_logs/new.html.erb

            <%= f.label :car_id%>
            <%= f.text_field(:car_id ,:value=>Car.where(user_id: current_user.id, id: @car.id).pluck(:car_name),:class=>'form-control',:readonly=>true )%>
---
SELECT "cars"."car_name" FROM "cars" WHERE "cars"."user_id" = ? AND "cars"."id" = ?  [["user_id", 1], ["id", 3]]