app/views/fuel_logs/new.html.erb

SELECT "cars"."make" FROM "cars" WHERE "cars"."user_id" = ? AND "cars"."car_id" = ?  [["user_id", 2], ["car_id", 5]]
---
          <%= f.label :car_id%>
          <%= f.text_field(:car_id ,:value=>Car.where(user_id: current_user.id, id: @car.id).pluck(:make),:class=>'form-control',:readonly=>true )%>