app/views/layouts/application.html.erb

        <% if logged_in? %>
          <p>Welcome, <%= User.where(id: current_user.id).pluck(:name).join%>!</p>
---
SELECT "users"."name" FROM "users" WHERE "users"."id" = ?  [["id", 1]]